{
  "movies": [
    {
      "id": 1,
      "title": "The Shawshank Redemption",
      "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
      "genre": "Drama"
    },
    {
      "id": 2,
      "title": "The Godfather",
      "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
      "genre": "Crime"
    },
    {
      "id": 3,
      "title": "The Dark Knight",
      "description": "When the menace known as the Joker wreaks havoc and chaos on Gotham City, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
      "genre": "Action"
    },
    {
      "id": 4,
      "title": "Pulp Fiction",
      "description": "The lives of two mob hitmen, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
      "genre": "Crime"
    },
    {
      "id": 5,
      "title": "Forrest Gump",
      "description": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal, the events of the 1960s – seen through the eyes of an exceptionally naive man.",
      "genre": "Drama"
    },
    {
      "id": 6,
      "title": "Inception",
      "description": "A thief who enters the dreams of others to steal secrets from their subconscious is given a chance to have his criminal history erased if he can implant an idea into a target's subconscious.",
      "genre": "Science Fiction"
    },
    {
      "id": 7,
      "title": "The Matrix",
      "description": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.",
      "genre": "Science Fiction"
    },
    {
      "id": 8,
      "title": "The Lord of the Rings: The Return of the King",
      "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
      "genre": "Fantasy"
    },
    {
      "id": 9,
      "title": "Fight Club",
      "description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
      "genre": "Drama"
    },
    {
      "id": 10,
      "title": "Interstellar",
      "description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
      "genre": "Science Fiction"
    }
  ],
  "genres": ["Drama", "Action", "Crime"]
}
